Repository: RomanRabinovich/Flutter_trading_service
Catalog: lib/presentation/common/resources/localizations/app_*.arb
Languages: uk

# passwordConfirm
source: Confirm password
uk: Підтвердіть пароль

# confirmationDialogTitle
source: Please, confirm your email
uk: Будь ласка, пiдтвердіть Вашу пошту

source: the Service Agreement
uk: Договір про надання послуг

# confirmationDialogContent
source: to continue registration you need to go to the mail and follow the link
uk: Для продовження регестраціі зайдіть на Вашу пошту та перейдіть по лінку

# iReadAndAcceptService
source: I have read and accept
uk: Я прочитав і приймаю

source: Remember me
uk: Запам'ятати мене

source: Forgot password?
uk: Забув пароль?

# forgotPasswordButton
source: Send reset link
uk: Вислати ссилку

# forgotPasswordTitle
source: Forgot password
uk: Забув пароль

# forgotPasswordContent
source: Enter the email address that you used to sign up, we will send you password reset link.
uk: Введіть адресу пошти, яку використали для регестраціі, ми вишлемо Вам ссилку на встановлення пароля.

source: Sign up
uk: Зареєструватися

# requestSent
source: Your request is sent, please wait for a reply letter within a few days
uk: Ваш запит був відіслан, будь ласка чекайте відповідь у продовж кількох днів

# sendRequestTitle
source: Do you want send request?
uk: Ви хочете зробити запит?

# sendRequestContent
source: If you forgot the code you can send a request to reset the two-factor authentication and our team will help you. It will take a few days.
uk: Якщо Ви забули код, можете надіслати запит для встановлення двох-факторноі регестраціі та наша команда допоможе Вам. Це займе декілька днів.

# sendRequestButton
source: Send request
uk: Запрос

# turnedOffTwoFactorTitle
source: We turned off two-factor authentication for the account
uk: Ми вимкнулі двох-факторну регестрацію для акаунта

# turnedOffTwoFactorContent
source: Please enable it in settings to add another layer of protection to your account.
uk: Будь ласка ввімкніть це в настройках щоб додати захист до вашого аккаунта.

# lostMyPhoneTitle
source: I lost my phone
uk: Я втратив свій телефон

# lostMyPhoneContent
source: If you are locked out of your account, you can disable two-factor authentication by entering your rescue code or send request to us
uk: Якщо Ви заблоковані у своєєму акаунті, Ви можете відключити двох-факторну регестрацію введеням коду чи запросити

# rescueCodeLostMyPhone
source: Rescue code
uk: Охоронний код

source: Submit code
uk: Розташувати код

source: Send request
uk: Надіслати запит

source: Cancel
uk: Відмінити

# twoFactorAuthTitleEnabled
source: Two-factor authentication
uk: Двух-факторна регестрація

# twoFactorAuthContentEnabled
source: Enter the security code from the authenticator app on your mobile phone.
uk: Введіть захисний код із Вашого регестраційного додатку на телефоні.

# twoFactorCannotUseAuthAppEnabled
source: I cannot use my authenticator app
uk: Я не можу використовувати регестраційний додаток

source: Submit
uk: Застосувати

# linkNotActiveTitle
source: Oh no, this link is not active already
uk: О ні, ця ссилка вже не працює

# linkNotActiveContent
source: Please try again
uk: Будь ласка спробуйте ще раз

# passwordUpdatedTitle
source: Your password has been successfully updated.
uk: Ваш пароль був успішно обновленний.

# passwordUpdatedContent
source: Sing in to enter your account.
uk: Зайдіть до свого профілю.

# resetPasswordTitle
source: Reset password
uk: Встановити пароль

# resetPasswordContent
source: Please enter your new password
uk: Будь ласка введіть новий пароль

# resetPasswordButton
source: Create password
uk: Створити пароль

# recoveryTitle
source: Recovery link sent
uk: Ссилка для встановлення вислана

# recoveryContent
source: An email has been sent to your email address i******@gmail.com. Follow the instructions in the email to reset your password.
uk: Лист був відосланий на Вашу поштову адрессу i******@gmail.com. Слідуйте на пошті для встановлення Вашого паролю.

# yourPasswordMustBe
source: *Your password must be at least 8 characters, include a number, an appercase letter and a lowercase letter, and symbol.
uk: *Ваш пароль має бути не менш 8 символів, включаючі цифри, заглавні літери, та символи.

# loginOrpasswordWrong
source: Login or password is wrong!!!
uk: Логін або пароль неправильний!!!

# enterPersonalData
source: Please, entre your personal data
uk: Будь ласка введіть Ваші персональні дані

source: secret key
uk: Таємний ключ

# enableTwoFactorAuthTitle
source: Enable two-factor authentication
uk: Дозволити двух-факторну регестрацію

# enableTwoFactorAuthContent
source: To enable two-factor authentication you need to have Authenticator App for example Google Authenticator on your mobile. It allows you to generate and store security codes on your phone
uk: Для того щоб ввімкнути двух-факторну регестрацію Ви повинні мати Регестраційний додаток Гугл Регестратор на Вашому дивайсі. Це дозволить Вам згенерувати та встановити захисний код на Вашому телефоні

# enableTwoFactorAuthStepOne
source: 1. Open Authenticator App on your mobile phone
uk: 1. Відкрийте регестраційний додаток на Вашому телефоні

# enableTwoFactorAuthStepTwo
source: 2. Scan QR code or enter secret key manually
uk: 2. Відскануйте QR код чи введіть таємний ключ вручну

# enableTwoFactorAuthStepThree
source: 3. Enter the security code generated by the application
uk: 3. Введіть таємний код згенерований додатком

source: Get started
uk: Почати

# getStartedScreenContent
source: Welcome to the online trading platform
uk: Ласкаво просимо до трейдінговоі платформи

source: Send again
uk: Вислати ще

# twoFactorRegistrationTitle
source: Enable two-factor authentication to protect your account
uk: Дозвольте Двух-факторну регестрацію для захисту вашого Акаунта

# twoFactorRegistrationContentFirst
source: Two-factor authentication adds another layer of protection to your account.
uk: Двух-факторну регестрація додає захіст до Вашого акаунта

# twoFactorRegistrationContentSecond
source: At login, you will need to enter the password and security code from the any authenticator app on your mobile phone.
uk: Під час регестраціі, Ви маєте ввести пароль та код захисту через любий пристрій чи мобільний телефон.

source: Later
uk: Піздніше

source: Enable
uk: Дозволити

source: First Name
uk: Ім'я

source: Last Name
uk: Прізвище

source: Password
uk: Пароль

source: Sign in
uk: Увійти

source: Email
uk: Пошта

# mainChartTabLabel
source: Chart
uk: Графік

# mainWatchlistTabLabel
source: Watchlist
uk: Вибране

# mainOrdersTabLabel
source: Orders
uk: Ордери

# mainPositionsTabLabel
source: Positions
uk: Позиції

# mainMoreTabLabel
source: More
uk: Більше

# mainProfileLabel
source: Profile
uk: Профіль
